# ***Forbes Top 2000 (Year:2017)***

## **Importing the required Libraries**

In [2]:
import pandas as pd
import numpy as np
import matplotlib .pyplot as plt
import seaborn as sns

## **Read the Dataset**

In [3]:
df=pd.read_excel('DataSet/Forbes-2017.xlsx')

In [17]:
df.shape

(2000, 7)

In [18]:
df.columns

Index(['Name', 'Country', 'Sales', 'Profit', 'Assets', 'Market Value', 'Year'], dtype='object')

In [13]:
df.head()

,Rank,Name,Country,Sales,Profit,Assets,Market Value,Year
0,1,ICBC,China,151.381,41.9837,3473.238,229.805,2017
1,2,China Construction Bank,China,134.242,34.9814,3016.578,200.458,2017
2,3,Berkshire Hathaway,United States,222.935,24.0740,620.854,409.908,2017
3,4,JPMorgan Chase,United States,102.494,24.2310,2512.986,306.616,2017
4,5,Wells Fargo,United States,97.573,21.9380,1943.443,274.385,2017

In [14]:
df.set_index('Rank',inplace=True)

In [15]:
df.head()

,Name,Country,Sales,Profit,Assets,Market Value,Year
Rank,,,,,,,
1,ICBC,China,151.381,41.9837,3473.238,229.805,2017
2,China Construction Bank,China,134.242,34.9814,3016.578,200.458,2017
3,Berkshire Hathaway,United States,222.935,24.0740,620.854,409.908,2017
4,JPMorgan Chase,United States,102.494,24.2310,2512.986,306.616,2017
5,Wells Fargo,United States,97.573,21.9380,1943.443,274.385,2017

In [4]:
df.isnull().sum()

Rank            0
Name            0
Country         0
Sales           2
Profit          0
Assets          1
Market Value    1
Year            0
dtype: int64

In [5]:
df.describe()

,Rank,Sales,Profit,Assets,Market Value,Year
count,2000.000000,1998.000000,2000.000000,1999.000000,1999.000000,2000.0
mean,1000.500000,17.680185,1.241552,84.569579,24.423543,2017.0
std,577.494589,29.329947,2.918115,261.044216,44.772378,0.0
min,1.000000,0.001000,-13.042100,0.001000,0.072000,2017.0
25%,500.750000,4.029250,0.317975,10.860500,6.639500,2017.0
50%,1000.500000,8.802500,0.612300,22.884000,11.944000,2017.0
75%,1500.250000,17.449500,1.279825,52.376000,24.362500,2017.0
max,2000.000000,485.252000,45.217000,3473.238000,752.039000,2017.0

In [8]:
df['Sales'].fillna(value=df['Sales'].mean(), inplace=True)

In [12]:
df['Market Value'].fillna(value=df['Market Value'].mean(), inplace=True)

In [19]:
df['Country'].value_counts()

United States     564
Japan             229
China             200
United Kingdom     91
South Korea        64
                 ...
Pakistan            1
Czech Republic      1
Puerto Rico         1
Egypt               1
Oman                1
Name: Country, Length: 61, dtype: int64

In [23]:
country_vise=df.groupby(['Country'])['Sales'].agg('sum')

In [27]:
country_vise.sort_values(ascending=False)

Country
United States     11503.815000
Japan              4195.509000
China              3904.757000
United Kingdom     1910.350185
Germany            1843.269000
                      ...
Jordan                2.373000
Egypt                 2.234000
Puerto Rico           1.933000
Pakistan              1.613000
Oman                  1.393000
Name: Sales, Length: 61, dtype: float64